bergb1/PSoC-safe-cracking-minigame/Lab7.cydsn/Generated_Source/PSoC5/TIMER_SOUND.c
/*******************************************************************************
* Function Name: TIMER_SOUND_ReadControlRegister
********************************************************************************
*
* Summary:
*  Reads the control register and returns it's value.
*
* Parameters:
*  void
*
* Return:
*  The contents of the control register
*
*******************************************************************************/
uint8 TIMER_SOUND_ReadControlRegister(void) 
{
    #if (!TIMER_SOUND_UDB_CONTROL_REG_REMOVED) 
        return ((uint8)TIMER_SOUND_CONTROL);
    #else
        return (0);
    #endif /* (!TIMER_SOUND_UDB_CONTROL_REG_REMOVED) */
}


/*******************************************************************************
* Function Name: TIMER_SOUND_WriteControlRegister
********************************************************************************
*
* Summary:
*  Sets the bit-field of the control register.
*
* Parameters:
*  control: The contents of the control register
*
* Return:
*
*******************************************************************************/
void TIMER_SOUND_WriteControlRegister(uint8 control) 
{
    #if (!TIMER_SOUND_UDB_CONTROL_REG_REMOVED) 
        TIMER_SOUND_CONTROL = control;
    #else
        control = 0u;
    #endif /* (!TIMER_SOUND_UDB_CONTROL_REG_REMOVED) */
}

#endif /* Remove API if control register is unused */


/*******************************************************************************
* Function Name: TIMER_SOUND_ReadPeriod
********************************************************************************
*
* Summary:
*  This function returns the current value of the Period.
*
* Parameters:
*  void
*
* Return:
*  The present value of the counter.
*
*******************************************************************************/
uint16 TIMER_SOUND_ReadPeriod(void) 
{
   #if(TIMER_SOUND_UsingFixedFunction)
       return ((uint16)CY_GET_REG16(TIMER_SOUND_PERIOD_LSB_PTR));
   #else
       return (CY_GET_REG16(TIMER_SOUND_PERIOD_LSB_PTR));
   #endif /* (TIMER_SOUND_UsingFixedFunction) */
}


/*******************************************************************************
* Function Name: TIMER_SOUND_WritePeriod
********************************************************************************
*
* Summary:
*  This function is used to change the period of the counter.  The new period
*  will be loaded the next time terminal count is detected.
*
* Parameters:
*  period: This value may be between 1 and (2^Resolution)-1.  A value of 0 will
*          result in the counter remaining at zero.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_SOUND_WritePeriod(uint16 period) 
{
    #if(TIMER_SOUND_UsingFixedFunction)
        uint16 period_temp = (uint16)period;
        CY_SET_REG16(TIMER_SOUND_PERIOD_LSB_PTR, period_temp);
    #else
        CY_SET_REG16(TIMER_SOUND_PERIOD_LSB_PTR, period);
    #endif /*Write Period value with appropriate resolution suffix depending on UDB or fixed function implementation */
}


/*******************************************************************************
* Function Name: TIMER_SOUND_ReadCapture
********************************************************************************
*
* Summary:
*  This function returns the last value captured.
*
* Parameters:
*  void
*
* Return:
*  Present Capture value.
*
*******************************************************************************/
uint16 TIMER_SOUND_ReadCapture(void) 
{
   #if(TIMER_SOUND_UsingFixedFunction)
       return ((uint16)CY_GET_REG16(TIMER_SOUND_CAPTURE_LSB_PTR));
   #else
       return (CY_GET_REG16(TIMER_SOUND_CAPTURE_LSB_PTR));
   #endif /* (TIMER_SOUND_UsingFixedFunction) */
}


/*******************************************************************************
* Function Name: TIMER_SOUND_WriteCounter
********************************************************************************
*
* Summary:
*  This funtion is used to set the counter to a specific value
*
* Parameters:
*  counter:  New counter value.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_SOUND_WriteCounter(uint16 counter) 
{
   #if(TIMER_SOUND_UsingFixedFunction)
        /* This functionality is removed until a FixedFunction HW update to
         * allow this register to be written
         */
        CY_SET_REG16(TIMER_SOUND_COUNTER_LSB_PTR, (uint16)counter);
        
    #else
        CY_SET_REG16(TIMER_SOUND_COUNTER_LSB_PTR, counter);
    #endif /* Set Write Counter only for the UDB implementation (Write Counter not available in fixed function Timer */
}


/*******************************************************************************
* Function Name: TIMER_SOUND_ReadCounter
********************************************************************************
*
* Summary:
*  This function returns the current counter value.
*
* Parameters:
*  void
*
* Return:
*  Present compare value.
*
*******************************************************************************/
uint16 TIMER_SOUND_ReadCounter(void) 
{
    /* Force capture by reading Accumulator */
    /* Must first do a software capture to be able to read the counter */
    /* It is up to the user code to make sure there isn't already captured data in the FIFO */
    #if(TIMER_SOUND_UsingFixedFunction)
        (void)CY_GET_REG16(TIMER_SOUND_COUNTER_LSB_PTR);
    #else
        (void)CY_GET_REG8(TIMER_SOUND_COUNTER_LSB_PTR_8BIT);
    #endif/* (TIMER_SOUND_UsingFixedFunction) */

    /* Read the data from the FIFO (or capture register for Fixed Function)*/
    #if(TIMER_SOUND_UsingFixedFunction)
        return ((uint16)CY_GET_REG16(TIMER_SOUND_CAPTURE_LSB_PTR));
    #else
        return (CY_GET_REG16(TIMER_SOUND_CAPTURE_LSB_PTR));
    #endif /* (TIMER_SOUND_UsingFixedFunction) */
}


#if(!TIMER_SOUND_UsingFixedFunction) /* UDB Specific Functions */

    
