bergb1/PSoC-safe-cracking-minigame/Lab7.cydsn/Generated_Source/PSoC5/TIMER_SOUND.c
    #if (!TIMER_SOUND_UDB_CONTROL_REG_REMOVED)
        /* Clear the Current Setting */
        TIMER_SOUND_CONTROL &= ((uint8)(~TIMER_SOUND_CTRL_INTCNT_MASK));
        /* Write The New Setting */
        TIMER_SOUND_CONTROL |= interruptCount;
    #endif /* (!TIMER_SOUND_UDB_CONTROL_REG_REMOVED) */
}
#endif /* TIMER_SOUND_InterruptOnCaptureCount */


#if (TIMER_SOUND_UsingHWCaptureCounter)


/*******************************************************************************
* Function Name: TIMER_SOUND_SetCaptureCount
********************************************************************************
*
* Summary:
*  This function sets the capture count
*
* Parameters:
*  captureCount: A value between 2 and 127 inclusive is valid.  A value of 1
*                to 127 will cause the interrupt to delay by the same number of
*                captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_SOUND_SetCaptureCount(uint8 captureCount) 
{
    TIMER_SOUND_CAP_COUNT = captureCount;
}


/*******************************************************************************
* Function Name: TIMER_SOUND_ReadCaptureCount
********************************************************************************
*
* Summary:
*  This function reads the capture count setting
*
* Parameters:
*  void
*
* Return:
*  Returns the Capture Count Setting
*
*******************************************************************************/
uint8 TIMER_SOUND_ReadCaptureCount(void) 
{
    return ((uint8)TIMER_SOUND_CAP_COUNT);
}
#endif /* TIMER_SOUND_UsingHWCaptureCounter */


/*******************************************************************************
* Function Name: TIMER_SOUND_ClearFIFO
********************************************************************************
*
* Summary:
*  This function clears all capture data from the capture FIFO
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_SOUND_ClearFIFO(void) 
{
    while(0u != (TIMER_SOUND_ReadStatusRegister() & TIMER_SOUND_STATUS_FIFONEMP))
    {
        (void)TIMER_SOUND_ReadCapture();
    }
}

#endif /* UDB Specific Functions */


/* [] END OF FILE */
